{
    "question:": "How can I create a will or trust?",
    "relevant_path": [
        {
            "law_number": "CAP 30",
            "cap title": "Wills Ordinance",
            "part_idx": 2,
            "part_title": "Wills",
            "section_idx": "3",
            "section_toc": "Section 3: All property may be disposed of by will\nSection Content: A person may by will, executed in accordance with this Ordinance, dispose of all property to which he is beneficially entitled at the time of his death and which on his death devolves on his personal representatives."
        },
        {
            "law_number": "CAP 30",
            "cap title": "Wills Ordinance",
            "part_idx": 2,
            "part_title": "Wills",
            "section_idx": "5",
            "section_toc": "Section 5: Signing and witnessing of a will\nSection Content: it is in writing, and signed by the testator, or by some other person in his presence and by his direction;\n- Article: Default Article\n-- Subsection (1)\n-- Subsection Leadin: Subject to section 6 , no will shall be valid unless— (Amended 21 of 2024 s. 78 )\n--- Paragraph (a)\n--- Paragraph Content: it is in writing, and signed by the testator, or by some other person in his presence and by his direction;\n--- Paragraph (b)\n--- Paragraph Content: it appears that the testator intended by his signature to give effect to the will;\n--- Paragraph (c)\n--- Paragraph Content: the signature is made or acknowledged by the testator in the presence of 2 or more witnesses present at the same time; and\n--- Paragraph (d)\n--- Paragraph Leadin: each witness either—\n---- Subparagraph (i)\n---- Subparagraph Content: attests and signs the will; or\n---- Subparagraph (ii)\n---- Subparagraph Content: acknowledges his signature,\n-- Subsection (2)\n-- Subsection Content: A document purporting to embody the testamentary intentions of a deceased person shall, notwithstanding that it has not been executed in accordance with the requirements under subsection (1), be deemed to be duly executed if, upon application, the court is satisfied that there can be no reasonable doubt that the document embodies the testamentary intentions of the deceased person."
        },
        {
            "law_number": "CAP 30",
            "cap title": "Wills Ordinance",
            "part_idx": 2,
            "part_title": "Wills",
            "section_idx": "23B",
            "section_toc": "Section 23B: Interpretation of wills—general provisions as to evidence\nSection Content: in so far as any part of it is meaningless;\n- Article: Default Article\n-- Subsection (1)\n-- Subsection Leadin: This section applies to a will—\n--- Paragraph (a)\n--- Paragraph Content: in so far as any part of it is meaningless;\n--- Paragraph (b)\n--- Paragraph Content: in so far as the language used in any part of it is ambiguous on the face of it;\n--- Paragraph (c)\n--- Paragraph Content: in so far as evidence, other than evidence of the testator’s intention, shows that the language used in any part of it is ambiguous in the light of surrounding circumstances.\n-- Subsection (2)\n-- Subsection Content: In so far as this section applies to a will extrinsic evidence, including evidence of the testator’s intention, may be admitted to assist in its interpretation."
        }
    ],
    "other_relevant_path": [
        {
            "law_number": "CAP 29",
            "cap title": "Trustee Ordinance"
        },
        {
            "law_number": "CAP 10",
            "cap title": "Probate and Administration Ordinance"
        },
        {
            "law_number": "CAP 501",
            "cap title": "Enduring Powers of Attorney Ordinance"
        },
        {
            "law_number": "CAP 253",
            "cap title": "Variation of Trusts Ordinance"
        },
        {
            "law_number": "CAP 30",
            "cap title": "Wills Ordinance",
            "part_idx": 1,
            "part_title": "Preliminary",
            "section_idx": "2",
            "section_toc": "Section 2: Interpretation"
        },
        {
            "law_number": "CAP 29",
            "cap title": "Trustee Ordinance",
            "part_idx": 5,
            "part_title": "Appointment and Discharge of Trustees",
            "section_idx": "36",
            "section_toc": "Section 36: Limitation of the number of trustees\nSection Content: Where, at the commencement of this Ordinance there are more than 4 trustees of a settlement of land or more than 4 trustees holding land on trust for sale, no new trustees shall (except where as a result of the appointment the number is reduced to 4 or less) be capable of being appointed until the number is reduced to less than 4, and thereafter the number shall not be increased beyond 4.\n- Article: Default Article\n-- Subsection (1)\n-- Subsection Content: Where, at the commencement of this Ordinance there are more than 4 trustees of a settlement of land or more than 4 trustees holding land on trust for sale, no new trustees shall (except where as a result of the appointment the number is reduced to 4 or less) be capable of being appointed until the number is reduced to less than 4, and thereafter the number shall not be increased beyond 4.\n-- Subsection (2)\n-- Subsection Leadin: In the case of settlements and dispositions on trust for sale of land made or coming into operation after the commencement of this Ordinance—\n--- Paragraph (a)\n--- Paragraph Content: the number of trustees thereof shall not in any case exceed 4, and where more than 4 persons are named as such trustees, the 4 first named (who are able and willing to act) shall alone be the trustees, and the other persons named shall not be trustees unless appointed on the occurrence of a vacancy;\n--- Paragraph (b)\n--- Paragraph Content: the number of the trustees shall not be increased beyond 4.\n-- Subsection (3)\n-- Subsection Content: The restrictions hereby imposed on the number of trustees do not apply in the case of land vested in trustees for charitable, ecclesiastical, or public purposes or where the net proceeds of the sale of the property are held for like purposes."
        },
        {
            "law_number": "CAP 29",
            "cap title": "Trustee Ordinance",
            "part_idx": 5,
            "part_title": "Appointment and Discharge of Trustees",
            "section_idx": "37",
            "section_toc": "Section 37: Power of appointing new or additional trustees\nSection Content: the person or persons nominated for the purpose of appointing new trustees by the instrument, if any, creating the trust; or\n- Article: Default Article\n-- Subsection (1)\n-- Subsection Leadin: Where a trustee, either original or substituted, and whether appointed by a court or otherwise, is dead, or remains out of Hong Kong for more than 12 months, or desires to be discharged from all or any of the trusts or powers reposed in or conferred on him, or refuses or is unfit to act therein, or is incapable of acting therein, or is a person under the age of 21 years, then, subject to the restrictions imposed by this Ordinance on the number of trustees—\n--- Paragraph (a)\n--- Paragraph Content: the person or persons nominated for the purpose of appointing new trustees by the instrument, if any, creating the trust; or\n--- Paragraph (b)\n--- Paragraph Content: if there is no such person, or no such person able and willing to act, then the surviving or continuing trustees or trustee for the time being, or the personal representatives of the last surviving or continuing trustee,\n-- Subsection (2)\n-- Subsection Content: Where a trustee has been removed under a power contained in the instrument creating the trust, a new trustee or new trustees may be appointed in the place of the trustee who is removed, as if he were dead, or, in the case of a corporation, as if the corporation desired to be discharged from the trust, and the provisions of this section shall apply accordingly, but subject to the restrictions imposed by this Ordinance on the number of trustees.\n-- Subsection (3)\n-- Subsection Content: Where a corporation being a trustee is or has been dissolved, either before or after the commencement of this Ordinance, then, for the purposes of this section and of any enactment replaced thereby, the corporation shall be deemed to be and to have been from the date of the dissolution incapable of acting in the trusts or powers reposed in or conferred on the corporation.\n-- Subsection (4)\n-- Subsection Content: The power of appointment given by subsection (1) or any similar previous enactment to the personal representatives of a last surviving or continuing trustee shall be and shall be deemed always to have been exercisable by the executors for the time being (whether original or by representation) of such surviving or continuing trustee who have proved the will of their testator or by the administrators for the time being of such trustee without the concurrence of any executor who has renounced or has not proved.\n-- Subsection (5)\n-- Subsection Content: But a sole or last surviving executor intending to renounce, or all the executors where they all intend to renounce, shall have and shall be deemed always to have had power, at any time before renouncing probate, to exercise the power of appointment given by this section, or by any similar previous enactment, if willing to act for that purpose and without thereby accepting the office of executor.\n-- Subsection (6)\n-- Subsection Leadin: Where a sole trustee, other than a trust corporation, is or has been originally appointed to act in a trust, or where, in the case of any trust, there are not more than 3 trustees (none of them being a trust corporation) either original or substituted and whether appointed by the court or otherwise, then and in any such case—\n--- Paragraph (a)\n--- Paragraph Content: the person or persons nominated for the purpose of appointing new trustees by the instrument, if any, creating the trust; or\n--- Paragraph (b)\n--- Paragraph Content: if there is no such person, or no such person able and willing to act, then the trustee or trustees for the time being,\n-- Subsection (7)\n-- Subsection Content: Every new trustee appointed under this section, as well before as after all the trust property becomes by law, or by assurance, or otherwise, vested in him, shall have the same powers, authorities, and discretions, and may in all respects act as if he had been originally appointed a trustee by the instrument, if any, creating the trust.\n-- Subsection (8)\n-- Subsection Content: The provisions of this section relating to a trustee who is dead include the case of a person nominated trustee in a will but dying before the testator, and those relative to a continuing trustee include a refusing or retiring trustee, if willing to act in the execution of the provisions of this section.\n-- Subsection (9)\n-- Subsection Content: Where a lunatic or person of unsound mind, being a trustee, is also entitled in possession to some beneficial interest in the trust property, no appointment of a new trustee in his place shall be made by the continuing trustees or trustee, under this section, unless leave has been given by the court to make the appointment."
        },
        {
            "law_number": "CAP 29",
            "cap title": "Trustee Ordinance",
            "part_idx": 5,
            "part_title": "Appointment and Discharge of Trustees",
            "section_idx": "38",
            "section_toc": "Section 38: Supplemental provisions as to appointment of trustees\nSection Content: the number of trustees may, subject to the restrictions imposed by this Ordinance on the number of trustees, be increased; and\n- Article: Default Article\n-- Subsection (1)\n-- Subsection Leadin: On the appointment of a trustee for the whole or any part of trust property—\n--- Paragraph (a)\n--- Paragraph Content: the number of trustees may, subject to the restrictions imposed by this Ordinance on the number of trustees, be increased; and\n--- Paragraph (b)\n--- Paragraph Content: a separate set of trustees, not exceeding 4 may be appointed for any part of the trust property held on trusts distinct from those relating to any other part or parts of the trust property, notwithstanding that no new trustees or trustee are or is to be appointed for other parts of the trust property, and any existing trustee may be appointed or remain one of such separate set of trustees, or, if only one trustee was originally appointed, then, save as hereinafter provided, one separate trustee may be appointed; and\n--- Paragraph (c)\n--- Paragraph Content: it shall not be obligatory, save as hereinafter provided, to appoint more than one new trustee where only one trustee was originally appointed, or to fill up the original number of trustees where more than 2 trustees were originally appointed, but, except where only one trustee was originally appointed, and a sole trustee when appointed will be able to give valid receipts for all capital money, a trustee shall not be discharged from his trust unless there will be either a trust corporation or at least 2 individuals to act as trustees to perform the trust; and\n--- Paragraph (d)\n--- Paragraph Content: any assurance or thing requisite for vesting the trust property, or any part thereof, in a sole trustee, or jointly in the persons who are the trustees, shall be executed or done.\n-- Subsection (2)\n-- Subsection Content: Nothing in this Ordinance shall authorize the appointment of a sole trustee, not being a trust corporation, where the trustee, when appointed, would be under the age of 21 years or, would not be able to give valid receipts for all capital money arising under the trust. (Amended 32 of 1990 s. 10 )"
        },
        {
            "law_number": "CAP 29",
            "cap title": "Trustee Ordinance",
            "part_idx": 7,
            "part_title": "Remuneration and Expenses",
            "section_idx": "41S",
            "section_toc": "Section 41S: Remuneration of trustees under instrument creating trust\nSection Content: is a trust corporation; or\n- Article: Default Article\n-- Subsection (1)\n-- Subsection Leadin: Subject to subsection (2)—\n--- Paragraph (a)\n--- Paragraph Leadin: subsections (3) and (4) apply to a trustee who—\n---- Subparagraph (i)\n---- Subparagraph Content: is a trust corporation; or\n---- Subparagraph (ii)\n---- Subparagraph Content: is not a trust corporation, but is acting in a professional capacity as a trustee of a non-charitable trust; and\n--- Paragraph (b)\n--- Paragraph Leadin: subsections (3) and (4) apply to a trustee—\n---- Subparagraph (i)\n---- Subparagraph Content: if the trustee is not a trust corporation, but is acting in a professional capacity as a trustee, other than the sole trustee, of a charitable trust; but\n---- Subparagraph (ii)\n---- Subparagraph Content: only to the extent to which a majority of the other trustees of the charitable trust have agreed that those subsections apply to the trustee, subject to any inconsistent provision in the instrument creating the trust or an enactment.\n-- Subsection (2)\n-- Subsection Leadin: Subsections (3) and (4) apply to a trustee—\n--- Paragraph (a)\n--- Paragraph Content: only if there is a provision in the instrument creating the trust or an enactment entitling the trustee to receive payment out of trust funds for services provided by the trustee to, or on behalf of, the trust; and\n--- Paragraph (b)\n--- Paragraph Content: except to the extent to which any inconsistent provision is made in the instrument creating the trust or an enactment.\n-- Subsection (3)\n-- Subsection Content: A trustee is to be treated as being entitled under the instrument creating the trust to receive payment for services provided even if the services are capable of being provided by a lay trustee.\n-- Subsection (4)\n-- Subsection Content: Any payment to which a trustee is entitled for services provided is to be treated as remuneration for services (but not as a disposition of property) for the purposes of section 10 of the Wills Ordinance ( Cap. 30 ) (avoidance of gifts to attesting witnesses and their spouses)."
        },
        {
            "law_number": "CAP 29",
            "cap title": "Trustee Ordinance",
            "part_idx": 7,
            "part_title": "Remuneration and Expenses",
            "section_idx": "41T",
            "section_toc": "Section 41T: Remuneration of trustees other than under instrument creating trust\nSection Content: subsections (3) and (4) apply to a trustee who is a trust corporation; and\n- Article: Default Article\n-- Subsection (1)\n-- Subsection Leadin: Subject to subsection (2)—\n--- Paragraph (a)\n--- Paragraph Content: subsections (3) and (4) apply to a trustee who is a trust corporation; and\n--- Paragraph (b)\n--- Paragraph Content: subsections (3) and (4) apply to a trustee who is not a trust corporation, but is acting in a professional capacity as a trustee, other than the sole trustee, of a trust if each of the other trustees of the trust has agreed in writing that the trustee may be remunerated for services provided by the trustee to, or on behalf of, the trust.\n-- Subsection (2)\n-- Subsection Leadin: Subsections (3) and (4) apply to a trustee of a charitable or non-charitable trust only if the trustee’s entitlement to remuneration—\n--- Paragraph (a)\n--- Paragraph Content: is not provided by the instrument creating the trust or an enactment; and\n--- Paragraph (b)\n--- Paragraph Content: is not expressly prohibited by a term in the instrument or enactment.\n-- Subsection (3)\n-- Subsection Content: A trustee is entitled to receive reasonable remuneration out of trust funds for services provided by the trustee to, or on behalf of, the trust.\n-- Subsection (4)\n-- Subsection Content: A trustee is to be treated as being entitled under this section to receive remuneration for services provided even if the services are capable of being provided by a lay trustee.\n-- Subsection (5)\n-- Subsection Content: This section applies to a trustee authorized to act in another capacity as it applies to any other trustee.\n-- Subsection (6)\n-- Subsection Leadin: For the purpose of subsection (5), a trustee authorized to act in another capacity is a trustee who has been authorized, under a power conferred by Part 4A (appointment of agents, nominees and custodians), the instrument creating the trust or an enactment—\n--- Paragraph (a)\n--- Paragraph Content: to exercise functions as a trustee’s agent; or\n--- Paragraph (b)\n--- Paragraph Content: to act as a nominee or custodian.\n-- Subsection (7)\n-- Subsection Leadin: For the purposes of this section—\n--- Paragraph (a)\n--- Paragraph Content: means, in relation to the provision of services by a trustee of a trust, the remuneration that is reasonable in the circumstances for the provision of those services by the trustee to, or on behalf of, the trust; and\n--- Paragraph (b)\n--- Paragraph Content: includes, in relation to the provision of services by a trustee who is an authorized institution under the Banking Ordinance ( Cap. 155 ) and provides those services in the course of, or incidental to, the exercise of its function as a trustee, the institution’s reasonable charges for the provision of those services."
        }
    ],
    "backend_model": "/home/hansirui/.cache/huggingface/hub/models--meta-llama--Llama-3.1-70B-Instruct/snapshots/945c8663693130f8be2ee66210e062158b2a9693/"
}