{
    "question:": "How can I create a will or trust?",
    "relevant_path": [
        {
            "law_number": "CAP 30",
            "cap title": "Wills Ordinance",
            "part_idx": 2,
            "part_title": "Wills",
            "section_idx": "3",
            "section_toc": "Section 3: All property may be disposed of by will\nSection Content: A person may by will, executed in accordance with this Ordinance, dispose of all property to which he is beneficially entitled at the time of his death and which on his death devolves on his personal representatives."
        },
        {
            "law_number": "CAP 30",
            "cap title": "Wills Ordinance",
            "part_idx": 2,
            "part_title": "Wills",
            "section_idx": "5",
            "section_toc": "Section 5: Signing and witnessing of a will\nSection Content: it is in writing, and signed by the testator, or by some other person in his presence and by his direction;\n- Article: Default Article\n-- Subsection (1)\n-- Subsection Leadin: Subject to section 6 , no will shall be valid unless— (Amended 21 of 2024 s. 78 )\n--- Paragraph (a)\n--- Paragraph Content: it is in writing, and signed by the testator, or by some other person in his presence and by his direction;\n--- Paragraph (b)\n--- Paragraph Content: it appears that the testator intended by his signature to give effect to the will;\n--- Paragraph (c)\n--- Paragraph Content: the signature is made or acknowledged by the testator in the presence of 2 or more witnesses present at the same time; and\n--- Paragraph (d)\n--- Paragraph Leadin: each witness either—\n---- Subparagraph (i)\n---- Subparagraph Content: attests and signs the will; or\n---- Subparagraph (ii)\n---- Subparagraph Content: acknowledges his signature,\n-- Subsection (2)\n-- Subsection Content: A document purporting to embody the testamentary intentions of a deceased person shall, notwithstanding that it has not been executed in accordance with the requirements under subsection (1), be deemed to be duly executed if, upon application, the court is satisfied that there can be no reasonable doubt that the document embodies the testamentary intentions of the deceased person."
        }
    ],
    "other_relevant_path": [
        {
            "law_number": "CAP 253",
            "cap title": "Variation of Trusts Ordinance"
        },
        {
            "law_number": "CAP 29",
            "cap title": "Trustee Ordinance"
        },
        {
            "law_number": "CAP 30",
            "cap title": "Wills Ordinance",
            "part_idx": 1,
            "part_title": "Preliminary",
            "section_idx": "1",
            "section_toc": "Section 1: Short title\nSection Content: This Ordinance may be cited as the Wills Ordinance ."
        },
        {
            "law_number": "CAP 30",
            "cap title": "Wills Ordinance",
            "part_idx": 2,
            "part_title": "Wills",
            "section_idx": "13",
            "section_toc": "Section 13: Modes of revocation of will\nSection Content: by marriage as provided by section 14 ;\n- Article: Default Article\n-- Subsection (1)\n-- Subsection Leadin: No will or part of a will shall be revoked otherwise than—\n--- Paragraph (a)\n--- Paragraph Content: by marriage as provided by section 14 ;\n--- Paragraph (b)\n--- Paragraph Content: by another valid will;\n--- Paragraph (c)\n--- Paragraph Content: by a written revocation executed in a manner in which the testator could validly execute a will; or\n--- Paragraph (d)\n--- Paragraph Content: by the burning, tearing or otherwise destroying of it by the testator, or by some person in his presence and by his direction, with the intention of revoking it.\n-- Subsection (2)\n-- Subsection Content: No will shall be revoked by any presumption of an intention on the ground of an alteration in circumstances."
        },
        {
            "law_number": "CAP 30",
            "cap title": "Wills Ordinance",
            "part_idx": 2,
            "part_title": "Wills",
            "section_idx": "14",
            "section_toc": "Section 14: Will to be revoked by marriage, except in certain cases\nSection Content: Subject to subsections (2), (3) and (4), a will shall be revoked by the testator’s marriage.\n- Article: Default Article\n-- Subsection (1)\n-- Subsection Content: Subject to subsections (2), (3) and (4), a will shall be revoked by the testator’s marriage.\n-- Subsection (2)\n-- Subsection Content: A disposition in a will in exercise of a power of appointment shall take effect notwithstanding the testator’s subsequent marriage unless the property so appointed would in default of appointment pass to his personal representatives.\n-- Subsection (3)\n-- Subsection Content: Where it appears from a will that at the time it was made the testator was expecting to be married to a particular person and that he intended that the will should not be revoked by the marriage, the will shall not be revoked by his marriage to that person.\n-- Subsection (4)\n-- Subsection Leadin: Where it appears from a will that at the time it was made the testator was expecting to be married to a particular person and that he intended that a disposition in the will should not be revoked by his marriage to that person—\n--- Paragraph (a)\n--- Paragraph Content: that disposition shall take effect notwithstanding the marriage; and\n--- Paragraph (b)\n--- Paragraph Content: any other disposition in the will shall take effect also, unless it appears from the will that the testator intended the disposition to be revoked by the marriage.\n-- Subsection (5)"
        },
        {
            "law_number": "CAP 30",
            "cap title": "Wills Ordinance",
            "part_idx": 2,
            "part_title": "Wills",
            "section_idx": "23B",
            "section_toc": "Section 23B: Interpretation of wills—general provisions as to evidence\nSection Content: in so far as any part of it is meaningless;\n- Article: Default Article\n-- Subsection (1)\n-- Subsection Leadin: This section applies to a will—\n--- Paragraph (a)\n--- Paragraph Content: in so far as any part of it is meaningless;\n--- Paragraph (b)\n--- Paragraph Content: in so far as the language used in any part of it is ambiguous on the face of it;\n--- Paragraph (c)\n--- Paragraph Content: in so far as evidence, other than evidence of the testator’s intention, shows that the language used in any part of it is ambiguous in the light of surrounding circumstances.\n-- Subsection (2)\n-- Subsection Content: In so far as this section applies to a will extrinsic evidence, including evidence of the testator’s intention, may be admitted to assist in its interpretation."
        },
        {
            "law_number": "CAP 30",
            "cap title": "Wills Ordinance",
            "part_idx": 2,
            "part_title": "Wills",
            "section_idx": "23C",
            "section_toc": "Section 23C: Presumption as to effect of gifts to donees\nSection Content: If a testator devises or bequeaths property to a donee in terms which in themselves would give an absolute interest to the donee, but by the same instrument purports to give any other person an interest in the same property, it shall, unless a contrary intention is shown, be presumed that the gift to the donee is absolute notwithstanding the purported gift to the other person."
        },
        {
            "law_number": "CAP 30",
            "cap title": "Wills Ordinance",
            "part_idx": 3,
            "part_title": "Conflict of Laws relating to Testamentary Dispositions",
            "section_idx": "25",
            "section_toc": "Section 25: Additional rules\nSection Content: a will executed on board a vessel or aircraft of any description, if the execution of the will conformed to the internal law in force in the territory with which, having regard to its registration (if any) and other relevant circumstances the vessel or aircraft may be taken to have been most closely connected;\n- Article: Default Article\n-- Subsection (1)\n-- Subsection Leadin: Without prejudice to section 24 , the following shall be treated as properly executed—\n--- Paragraph (a)\n--- Paragraph Content: a will executed on board a vessel or aircraft of any description, if the execution of the will conformed to the internal law in force in the territory with which, having regard to its registration (if any) and other relevant circumstances the vessel or aircraft may be taken to have been most closely connected;\n--- Paragraph (b)\n--- Paragraph Content: a will so far as it disposes of immovable property, if its execution conformed to the internal law in force in the territory where the property was situated;\n--- Paragraph (c)\n--- Paragraph Content: a will so far as it revokes a will which under this Part would be treated as properly executed or revokes a provision which under this Part would be treated as comprised in a properly executed will, if the execution of the later will conformed to any law by reference to which the revoked will or provision would be so treated;\n--- Paragraph (d)\n--- Paragraph Content: a will so far as it exercises a power of appointment, if the execution of the will conformed to the law governing the essential validity of the power.\n-- Subsection (2)\n-- Subsection Content: A will so far as it exercises a power of appointment shall not be treated as improperly executed by reason only that its execution was not in accordance with any formal requirements contained in the instrument creating the power."
        }
    ],
    "backend_model": "/home/hansirui/.cache/huggingface/hub/models--meta-llama--Llama-3.1-70B-Instruct/snapshots/945c8663693130f8be2ee66210e062158b2a9693/"
}