{
    "question:": "On the morning of 24 August 2013, the defendant arrived in Hong Kong by air and was attempting to use a special immigration channel.\\nThe defendant was told he could not use this channel and became upset. He also smelt of alcohol.\\nAn immigration officer directed him towards normal clearance, and the defendant's behavior attracted the attention of three police officers who were on anti-terrorist duty.\\nShortly after that, the defendant allegedly grabbed one of the sub-machine guns held by one of the police officers and pulled it and the officer towards him. The defendant was subdued and apologised.\\nPW1, PW2, PW3, PW4, and PW5 witnessed the incident. PW3's evidence was that he saw the defendant gra bbing and pulling his sub-machine gun.\\nA CCTV camera recorded the area, capturing the incident, though it was obscured at times.\\nThe defendant’s wife and 12-year-old daughter went through immigration ahead of him, and he had travelled from Incheon International Airport with them.\\nThe defendant described the incident as an attempt to apologize to the police officer, citing cultural norms as his explanation for the alleged grabbing action.\\nPW3, the police officer, verified the defendant's alleged alcohol intoxication.",
    "relevant_path": [
        {
            "law_number": "CAP 221",
            "cap title": "Criminal Procedure Ordinance",
            "part_idx": 3,
            "part_title": "Proceedings at Trial",
            "section_idx": "75A",
            "section_toc": "Section 75A: Determination as to whether accused person under disability did the act or made the omission charged\nSection Content: without prejudice to any proceedings for the purposes of paragraph (b)(ii) , the trial shall not proceed or further proceed;\n- Article: Default Article\n-- Subsection (1)\n-- Subsection Leadin: Where in accordance with section 75 it is determined by a jury that an accused person is under disability, then—\n--- Paragraph (a)\n--- Paragraph Content: without prejudice to any proceedings for the purposes of paragraph (b)(ii) , the trial shall not proceed or further proceed;\n--- Paragraph (b)\n--- Paragraph Leadin: the jury shall determine—\n---- Subparagraph (i)\n---- Subparagraph Content: on the evidence (if any) already given in the trial; and\n---- Subparagraph (ii)\n---- Subparagraph Content: on such evidence as may be adduced or further adduced by the prosecution or adduced by a person appointed by the court for the purpose of this section to put the case for the defence,\n--- Paragraph (c)\n--- Paragraph Content: if the jury are so satisfied as respects that count or any of those counts, they shall make a finding that the accused person did that act or made that omission;\n--- Paragraph (d)\n--- Paragraph Content: if the jury are not so satisfied as respects that count or any of those counts, they shall return a verdict of acquittal as if on the count concerned the trial had proceeded to a conclusion.\n-- Subsection (2)\n-- Subsection Content: Section 75(6) and (7) shall apply to this section as it applies to section 75 .\n-- Subsection (3)\n-- Subsection Leadin: For the avoidance of doubt it is hereby declared that—\n--- Paragraph (a)\n--- Paragraph Content: evidence that may be adduced under subsection (1)(b)(ii) includes the testimony of witnesses;\n--- Paragraph (b)\n--- Paragraph Content: the law applicable in criminal proceedings shall be the law applicable in any proceedings arising under subsection (1)(b) ."
        },
        {
            "law_number": "CAP 221",
            "cap title": "Criminal Procedure Ordinance",
            "part_idx": 9,
            "part_title": "Miscellaneous",
            "section_idx": "101D",
            "section_toc": "Section 101D: Acts constituting 2 or more offences\nSection Content: Where any act constitutes 2 or more offences, whether under the same Ordinance or otherwise, the offender shall be liable to be prosecuted and punished for any or all such offences but shall not be liable to be punished twice for the same offence."
        },
        {
            "law_number": "CAP 245",
            "cap title": "Public Order Ordinance",
            "part_idx": 3,
            "part_title": "Control of Meetings, Processions and Gatherings",
            "section_idx": "17B",
            "section_toc": "Section 17B: Disorder in public places\nSection Content: Any person who at any public gathering acts in a disorderly manner for the purpose of preventing the transaction of the business for which the public gathering was called together or incites others so to act shall be guilty of an offence and shall be liable on conviction to a fine at level 2 and to imprisonment for 12 months.\n- Article: Default Article\n-- Subsection (1)\n-- Subsection Content: Any person who at any public gathering acts in a disorderly manner for the purpose of preventing the transaction of the business for which the public gathering was called together or incites others so to act shall be guilty of an offence and shall be liable on conviction to a fine at level 2 and to imprisonment for 12 months.\n-- Subsection (2)\n-- Subsection Content: Any person who in any public place behaves in a noisy or disorderly manner, or uses, or distributes or displays any writing containing, threatening, abusive or insulting words, with intent to provoke a breach of the peace, or whereby a breach of the peace is likely to be caused, shall be guilty of an offence and shall be liable on conviction to a fine at level 2 and to imprisonment for 12 months."
        },
        {
            "law_number": "CAP 245",
            "cap title": "Public Order Ordinance",
            "part_idx": 9,
            "part_title": "General",
            "section_idx": "46",
            "section_toc": "Section 46: Restriction on use of force\nSection Content: Whenever in this Ordinance it is provided that such force as may be necessary may be used for any purpose, the degree of force which may be so used shall not be greater than is reasonably necessary for that purpose.\n- Article: Default Article\n-- Subsection (1)\n-- Subsection Content: Whenever in this Ordinance it is provided that such force as may be necessary may be used for any purpose, the degree of force which may be so used shall not be greater than is reasonably necessary for that purpose.\n-- Subsection (2)\n-- Subsection Content: Nothing in this section shall derogate from the lawful right of any person to use force in the defence of person or property.\n-- Subsection (3)\n-- Subsection Content: Any person who uses such force as may be necessary for any purpose, in accordance with the provisions of this Ordinance, shall not be liable in any criminal or civil proceeding for having, by the use of such force, caused injury or death to any person or damage to or loss of any property."
        }
    ],
    "other_relevant_path": [
        {
            "law_number": "CAP 238",
            "cap title": "Firearms and Ammunition Ordinance"
        },
        {
            "law_number": "CAP 217",
            "cap title": "Weapons Ordinance"
        },
        {
            "law_number": "CAP 136",
            "cap title": "Mental Health Ordinance"
        },
        {
            "law_number": "CAP 212",
            "cap title": "Offences against the Person Ordinance"
        },
        {
            "law_number": "CAP 238",
            "cap title": "Firearms and Ammunition Ordinance",
            "part_idx": 3,
            "part_title": "Offences",
            "section_idx": "16",
            "section_toc": "Section 16: Possession of arms or ammunition with intent to endanger life\nSection Content: A person commits an offence who has in his possession any arms or ammunition with intent by means thereof to endanger life or to enable another person by means thereof to endanger life.\n- Article: Default Article\n-- Subsection (1)\n-- Subsection Content: A person commits an offence who has in his possession any arms or ammunition with intent by means thereof to endanger life or to enable another person by means thereof to endanger life.\n-- Subsection (2)\n-- Subsection Content: A person who commits an offence under subsection (1) is liable on conviction upon indictment to imprisonment for life. (Amended 59 of 1984 s. 3 )"
        },
        {
            "law_number": "CAP 238",
            "cap title": "Firearms and Ammunition Ordinance",
            "part_idx": 6,
            "part_title": "Enforcement",
            "section_idx": "43",
            "section_toc": "Section 43: Obstruction\nSection Content: Any person who obstructs a police officer or member of the Customs and Excise Service in the exercise of any power conferred on him by section 40 , 41 or 42 commits an offence and is liable to a fine at level 3 and to imprisonment for 6 months."
        },
        {
            "law_number": "CAP 136",
            "cap title": "Mental Health Ordinance",
            "part_idx": 2,
            "part_title": "Management of Property and Affairs of Mentally Incapacitated Persons",
            "section_idx": "26",
            "section_toc": "Section 26: Order for detention of mentally disordered person\nSection Content: When upon any inquiry under this Part any person has been found by the Court to be mentally disordered and incapable, by reason of mental disorder, of managing and administering his property and affairs, the Court may make an order for such person to be received into a mental hospital and send him in suitable custody, together with the order for his reception, to the mental hospital named in such order."
        },
        {
            "law_number": "CAP 136",
            "cap title": "Mental Health Ordinance",
            "part_idx": 4,
            "part_title": "Guardianship of Persons Concerned in Criminal Proceedings",
            "section_idx": "44A",
            "section_toc": "Section 44A: Power of court or magistrate to make guardianship order\nSection Content: section 76(1) of the Criminal Procedure Ordinance ( Cap. 221 ) applies to a person;\n- Article: Default Article\n-- Subsection (1)\n-- Subsection Leadin: Where—\n--- Paragraph (a)\n--- Paragraph Content: section 76(1) of the Criminal Procedure Ordinance ( Cap. 221 ) applies to a person;\n--- Paragraph (b)\n--- Paragraph Leadin: the court or magistrate concerned is satisfied, on the written or oral evidence of 2 or more registered medical practitioners (of whom not less than 2 shall be psychiatrists on the Specialist Register established under section 6(3) of the Medical Registration Ordinance ( Cap. 161 )), that— (Amended 32 of 2000 s. 9 )\n---- Subparagraph (i)\n---- Subparagraph Content: the person is mentally incapacitated to a nature or degree which warrants his reception into guardianship under this Part; and (Amended 81 of 1997 s. 33 )\n---- Subparagraph (ii)\n---- Subparagraph Content: it is necessary in the interests of the welfare of the person or for the protection of other persons that the person should be so received; and (Amended 81 of 1997 s. 33 )\n--- Paragraph (c)\n--- Paragraph Leadin: the court or magistrate is of the opinion, having regard to all the circumstances of the case, including—\n---- Subparagraph (i)\n---- Subparagraph Content: the nature of any act or omission by virtue of which the section referred to in paragraph (a) applies to him;\n---- Subparagraph (ii)\n---- Subparagraph Content: the character and antecedents of the person;\n---- Subparagraph (iii)\n---- Subparagraph Content: the other available methods of dealing with him; and\n---- Subparagraph (iv)\n---- Subparagraph Content: the suitability of an order under this section in the case of the person; and\n---- Subparagraph (A)\n---- Subparagraph Content: the suitability of an order under this section in the case of the person; and\n---- Subparagraph (B)\n---- Subparagraph Content: where applicable, the availability of a suitable person to be authorized under paragraph (i) if there is an order under this section in the case of the person,\n--- Paragraph (i)\n--- Paragraph Content: by an order ( guardianship order ) place the person under the guardianship of the Director of Social Welfare, or a person authorized by the Director of Social Welfare for the purpose, as may be specified in the order;\n--- Paragraph (ii)\n--- Paragraph Content: specify in the guardianship order the period ( validity period ) during which the person should be so placed which shall not exceed 1 year commencing on the date of the order. (Amended 81 of 1997 s. 33 )\n-- Subsection (2)\n-- Subsection Content: Section 45(3) shall apply to a guardianship order as it applies to a hospital order."
        },
        {
            "law_number": "CAP 136",
            "cap title": "Mental Health Ordinance",
            "part_idx": 6,
            "part_title": "Admission of Mentally Disordered Persons Concerned in Criminal Proceedings, Transfer of Mentally Disordered Persons Under Sentence and Remand of Mentally Incapacitated Persons",
            "section_idx": "45",
            "section_toc": "Section 45: Powers of court or magistrate to make a hospital order\nSection Content: convicted by the Court of First Instance or a District Court of an offence other than an offence the sentence for which is fixed by law; (Amended 25 of 1998 s. 2 )\n- Article: Default Article\n-- Subsection (1)\n-- Subsection Leadin: Where—\n--- Paragraph (a)\n--- Paragraph Leadin: a person is—\n---- Subparagraph (i)\n---- Subparagraph Content: convicted by the Court of First Instance or a District Court of an offence other than an offence the sentence for which is fixed by law; (Amended 25 of 1998 s. 2 )\n---- Subparagraph (ii)\n---- Subparagraph Content: convicted by a magistrate of an offence punishable on summary conviction by imprisonment; or\n---- Subparagraph (iii)\n---- Subparagraph Content: charged before a magistrate with an act or omission as an offence punishable on summary conviction by imprisonment and the magistrate is satisfied that such person did the act or made the omission; and\n--- Paragraph (b)\n--- Paragraph Leadin: the court or magistrate is satisfied on the written or oral evidence of 2 registered medical practitioners received in accordance with section 46 that—\n---- Subparagraph (i)\n---- Subparagraph Content: such person is a mentally disordered person; and\n---- Subparagraph (ii)\n---- Subparagraph Content: the nature or degree of the mental disorder from which the person is suffering warrants his detention in the Correctional Services Department Psychiatric Centre or a mental hospital for treatment; and\n--- Paragraph (c)\n--- Paragraph Content: the court or magistrate is of the opinion, having regard to all the circumstances including the nature of the offence and the character and antecedents of such person, and to the other available methods of dealing with him, that the most suitable method of disposing of the case is by means of an order under this section,\n-- Subsection (1A)\n-- Subsection Content: Where under subsection (1) the court or magistrate by a hospital order authorizes the admission of a person to, and detention in, a mental hospital, and is of the opinion that in all the circumstances of the case the proviso to section 47(2) should not apply, the judge or magistrate may include a statement to that effect in the hospital order and, if he does so, that proviso shall not apply. (Added 46 of 1988 s. 15 )\n-- Subsection (2)\n-- Subsection Content: A hospital order shall not be made under this section unless the court or magistrate is satisfied that arrangements have been made for the admission of the person to the Correctional Services Department Psychiatric Centre or that mental hospital within 28 days after the date of the hospital order, in the event of the hospital order being made by the court or magistrate. (Amended 37 of 1973 s. 3 )\n-- Subsection (3)"
        },
        {
            "law_number": "CAP 136",
            "cap title": "Mental Health Ordinance",
            "part_idx": 9,
            "part_title": "Medical and Dental Treatment",
            "section_idx": "59ZB",
            "section_toc": "Section 59ZB: Application and principles\nSection Content: in the case of a mentally incapacitated person who is mentally disordered, treatment of that person in a mental hospital or the Correctional Services Department Psychiatric Centre in relation to his mental disorder; or\n- Article: Default Article\n-- Subsection (1)\n-- Subsection Leadin: This Part applies to treatment or special treatment of a mentally incapacitated person who has attained the age of 18 years and is incapable of giving consent to the carrying out of that treatment or that special treatment, as the case may be, but does not apply to—\n--- Paragraph (a)\n--- Paragraph Content: in the case of a mentally incapacitated person who is mentally disordered, treatment of that person in a mental hospital or the Correctional Services Department Psychiatric Centre in relation to his mental disorder; or\n--- Paragraph (b)\n--- Paragraph Content: in the case of a mentally incapacitated person who is a supervised person (within the meaning of Part IIIB), treatment of that person pursuant to a supervision and treatment order made under that Part.\n-- Subsection (2)\n-- Subsection Content: A mentally incapacitated person is incapable of giving such consent if that person is incapable of understanding the general nature and effect of the treatment or special treatment.\n-- Subsection (3)\n-- Subsection Leadin: The Court when considering whether or not to give consent to the carrying out of treatment or special treatment, or the guardian when considering whether or not to give consent to the carrying out of treatment, under this Part, shall observe and apply the following principles, namely to—\n--- Paragraph (a)\n--- Paragraph Content: ensure that the mentally incapacitated person is not deprived of the treatment or special treatment, as the case may be, merely because he lacks the capacity to consent to the carrying out of that treatment or that special treatment; and\n--- Paragraph (b)\n--- Paragraph Content: ensure that any treatment or special treatment that is proposed to be carried out in respect of the mentally incapacitated person is carried out in the best interests of that person."
        },
        {
            "law_number": "CAP 136",
            "cap title": "Mental Health Ordinance",
            "part_idx": 9,
            "part_title": "Medical and Dental Treatment",
            "section_idx": "59ZF",
            "section_toc": "Section 59ZF: When treatment may be carried out without consent\nSection Content: Treatment by a registered medical practitioner or registered dentist may be carried out in respect of a mentally incapacitated person to whom this Part applies without consent under section 59ZD(1) or (2) if that registered medical practitioner or registered dentist intending to carry out or supervise the treatment considers that as a matter of urgency that treatment is necessary and is in the best interests of the mentally incapacitated person.\n- Article: Default Article\n-- Subsection (1)\n-- Subsection Content: Treatment by a registered medical practitioner or registered dentist may be carried out in respect of a mentally incapacitated person to whom this Part applies without consent under section 59ZD(1) or (2) if that registered medical practitioner or registered dentist intending to carry out or supervise the treatment considers that as a matter of urgency that treatment is necessary and is in the best interests of the mentally incapacitated person.\n-- Subsection (2)\n-- Subsection Leadin: Subject to subsection (3), treatment by a registered medical practitioner or registered dentist may be carried out in respect of a mentally incapacitated person to whom this Part applies without consent under section 59ZD(1) if—\n--- Paragraph (a)\n--- Paragraph Content: after all reasonably practicable steps have been taken by that practitioner or that dentist to ascertain whether or not a guardian has been appointed under Part IIIA or IVB responsible for that person, there is, or appears to be, no guardian so appointed; or\n--- Paragraph (b)\n--- Paragraph Content: the guardian appointed under Part IIIA or IVB has not been conferred the power to consent in a guardianship order under section 44B(1)(d) or 59R(3)(d) .\n-- Subsection (3)\n-- Subsection Content: Where a registered medical practitioner or registered dentist intending to carry out or supervise the treatment under subsection (2) considers that that treatment is necessary and is in the best interests of the mentally incapacitated person, then he may carry out that treatment without the consent of the mentally incapacitated person or that person’s guardian (if any) accordingly."
        },
        {
            "law_number": "CAP 136",
            "cap title": "Mental Health Ordinance",
            "part_idx": 10,
            "part_title": "General provisions",
            "section_idx": "65",
            "section_toc": "Section 65: Offences against patients\nSection Content: Any attendant, nurse, servant or other person employed in a mental hospital who ill-treats or wilfully neglects any patient shall be guilty of an offence and shall be liable on summary conviction to a fine at level 2 and imprisonment for 2 years. (Amended 46 of 1988 s. 24 )\n- Article: Default Article\n-- Subsection (1)\n-- Subsection Content: Any attendant, nurse, servant or other person employed in a mental hospital who ill-treats or wilfully neglects any patient shall be guilty of an offence and shall be liable on summary conviction to a fine at level 2 and imprisonment for 2 years. (Amended 46 of 1988 s. 24 )\n-- Subsection (2)\n-- Subsection Leadin: Without prejudice to section 125 of the Crimes Ordinance ( Cap. 200 ), any man who is an officer on the staff of, or is otherwise employed in—\n--- Paragraph (a)\n--- Paragraph Content: a mental hospital, and has unlawful sexual intercourse with a woman who is detained in that hospital;\n--- Paragraph (b)\n--- Paragraph Content: the Correctional Services Department Psychiatric Centre and has unlawful sexual intercourse with a woman who is detained in that Centre; or\n--- Paragraph (c)\n--- Paragraph Content: a mental hospital or general hospital, and has unlawful sexual intercourse with a woman who is receiving treatment for a mental disorder in the mental hospital or the psychiatric unit of the general hospital, where such intercourse takes place on the premises of the mental hospital or psychiatric unit or on premises of which the mental hospital or psychiatric unit forms part,\n-- Subsection (3)\n-- Subsection Content: Consent shall not be a defence in any proceedings for an offence under subsection (2) if the accused knew, or had reasonable grounds to suspect at the time when intercourse took place, that the woman with whom he had sexual intercourse was such a woman as is described in paragraph (a), (b) or (c) of that subsection. (Replaced 46 of 1988 s. 24 )\n-- Subsection (4)\n-- Subsection Content: If on the trial of any person for rape the Court or jury is satisfied that the accused is guilty of an offence under subsection (2) but are not satisfied that he is guilty of rape, the Court or jury shall acquit him of rape and shall find him guilty of an offence under subsection (2)."
        },
        {
            "law_number": "CAP 136",
            "cap title": "Mental Health Ordinance",
            "part_idx": 10,
            "part_title": "General provisions",
            "section_idx": "71",
            "section_toc": "Section 71: Powers of a District Judge and a magistrate\nSection Content: For the purpose of the exercise of the power conferred by section 31 a District Judge and a magistrate may exercise the powers conferred on a magistrate by the Magistrates Ordinance ( Cap. 227 ) of requiring the attendance before him of any person who may be able to assist him in the exercise of such power and of receiving on oath the evidence of any person."
        },
        {
            "law_number": "CAP 136",
            "cap title": "Mental Health Ordinance",
            "part_idx": 10,
            "part_title": "General provisions",
            "section_idx": "71B",
            "section_toc": "Section 71B: Mentally disordered persons found in need of care or control\nSection Content: If a police officer finds in any place a person whom he reasonably believes to be suffering from mental disorder and to be in immediate need of care or control, the officer may, notwithstanding the provisions of section 51 of the Police Force Ordinance ( Cap. 232 ), take that person into custody and remove him forthwith to a place of safety if the officer thinks it necessary to do so in the interests of that person or for the protection of other persons.\n- Article: Default Article\n-- Subsection (1)\n-- Subsection Content: If a police officer finds in any place a person whom he reasonably believes to be suffering from mental disorder and to be in immediate need of care or control, the officer may, notwithstanding the provisions of section 51 of the Police Force Ordinance ( Cap. 232 ), take that person into custody and remove him forthwith to a place of safety if the officer thinks it necessary to do so in the interests of that person or for the protection of other persons.\n-- Subsection (2)\n-- Subsection Content: A person who is in, or is removed under this section to, a place of safety may be detained there for a period not exceeding 24 hours for the purpose of enabling him to be examined by a registered medical practitioner and of making necessary arrangements for his treatment and care.\n-- Subsection (3)\n-- Subsection Content: Such force as is reasonably necessary may be used for the purposes of taking a person into custody and removing him to a place of safety, and for detaining him there, under this section.\n-- Subsection (4)\n-- Subsection (5)\n-- Subsection Content: Nothing in subsection (1) shall confer upon any police officer a right to enter upon any premises."
        },
        {
            "law_number": "CAP 221",
            "cap title": "Criminal Procedure Ordinance",
            "part_idx": 1,
            "part_title": "Bail",
            "section_idx": "9G",
            "section_toc": "Section 9G: An accused person may be refused bail in particular circumstances\nSection Content: fail to surrender to custody as the court may appoint; or\n- Article: Default Article\n-- Subsection (1)\n-- Subsection Leadin: The court need not admit an accused person to bail if it appears to the court that there are substantial grounds for believing, whether or not an admission were to be subject to conditions under section 9D(2) , that the accused person would—\n--- Paragraph (a)\n--- Paragraph Content: fail to surrender to custody as the court may appoint; or\n--- Paragraph (b)\n--- Paragraph Content: commit an offence while on bail; or\n--- Paragraph (c)\n--- Paragraph Content: interfere with a witness or pervert or obstruct the course of justice.\n-- Subsection (2)\n-- Subsection Leadin: The court in forming an opinion under subsection (1) may have regard to—\n--- Paragraph (a)\n--- Paragraph Content: the nature and seriousness of the alleged offence and, in the event of conviction, the manner in which the accused person is likely to be dealt with;\n--- Paragraph (b)\n--- Paragraph Content: the behaviour, demeanour and conduct of the accused person;\n--- Paragraph (c)\n--- Paragraph Content: the background, associations, employment, occupation, home environment, community ties and financial position of the accused person;\n--- Paragraph (d)\n--- Paragraph Content: the health, physical and mental condition and age of the accused person;\n--- Paragraph (e)\n--- Paragraph Content: the history of any previous admissions to bail of the accused person;\n--- Paragraph (f)\n--- Paragraph Content: the character, antecedents and previous convictions, if any, of the accused person;\n--- Paragraph (g)\n--- Paragraph Content: the nature and weight of the evidence of the commission of the alleged offence by the accused person;\n--- Paragraph (h)\n--- Paragraph Content: any other thing that appears to the court to be relevant.\n-- Subsection (3)\n-- Subsection Leadin: An accused person need not be admitted to bail if it appears to the court that he should be detained in custody for—\n--- Paragraph (a)\n--- Paragraph Content: if he has attained the age of 18 years, his own protection; or\n--- Paragraph (b)\n--- Paragraph Content: if he has not attained the age of 18 years, his own protection, safety or welfare; or\n--- Paragraph (c)\n--- Paragraph Content: the purpose of further inquiry relating to the determining of the question of whether he should be admitted to bail.\n-- Subsection (4)\n-- Subsection Leadin: An accused person need not be admitted to bail if—\n--- Paragraph (a)\n--- Paragraph Leadin: he is detained in custody—\n---- Subparagraph (i)\n---- Subparagraph Content: under a sentence of any court; or\n---- Subparagraph (ii)\n---- Subparagraph Content: for or in connection with a charge of failing to surrender to custody under section 9L ; or\n--- Paragraph (b)\n--- Paragraph Leadin: the court is satisfied that—\n---- Subparagraph (i)\n---- Subparagraph Content: he has previously failed to comply with any condition of bail imposed under section 9D ; or\n---- Subparagraph (ii)\n---- Subparagraph Content: any other court dealing with him in the same proceedings is or has been so satisfied.\n-- Subsection (5)\n-- Subsection Content: An accused person need not be admitted to bail if he is the subject of a hospital order for the time being in force.\n-- Subsection (6)\n-- Subsection Content: An accused person need not be admitted to bail if he is the subject of an order made under section 109B (suspended sentence) for the time being in force and he is before the court under section 109D or 109E .\n-- Subsection (7)\n-- Subsection Content: An accused person need not be admitted to bail if he is the subject of a deportation order for the time being in force made under section 20 of the Immigration Ordinance ( Cap. 115 ).\n-- Subsection (8)\n-- Subsection Content: An accused person need not be admitted to bail if he is before the court under section 5 or 6 of the Probation of Offenders Ordinance ( Cap. 298 ) (breach of probation order; or commission of further offence).\n-- Subsection (9)\n-- Subsection Content: An accused person need not be admitted to bail if he is before the court under section 8 or 9 of the Community Service Orders Ordinance ( Cap. 378 ) (breach of community service order; or commission of further offence).\n-- Subsection (10)\n-- Subsection Content: An accused person charged with murder may be admitted to bail only on the order of a judge. (Replaced 6 of 2024 s. 141 )\n-- Subsection (11)\n-- Subsection Leadin: If at any hearing the court refuses to admit an accused person to bail the court shall, at each subsequent hearing while the accused remains in custody, consider the question of whether or not he ought to be admitted to bail and—\n--- Paragraph (a)\n--- Paragraph Content: on the first occasion after that upon which the court first refused to so admit, the court shall hear any argument as to fact or law put to it in support of his admission to bail, whether or not it has previously heard that argument;\n--- Paragraph (b)\n--- Paragraph Content: on the second or any subsequent occasion after that upon which the court first refused to so admit, the court need not hear any argument as to fact or law put to it in support of his admission to bail, if it has previously heard that argument."
        },
        {
            "law_number": "CAP 221",
            "cap title": "Criminal Procedure Ordinance",
            "part_idx": 3,
            "part_title": "Proceedings at Trial",
            "section_idx": "53",
            "section_toc": "Section 53: Objection of substance to indictment\nSection Content: No objection to an indictment shall be taken by way of demurrer, but if an indictment does not state in substance an indictable offence or states an offence not triable by the court, the accused person may move the court to quash it or in arrest of judgment. (Amended 50 of 1911 s. 4 )\n- Article: Default Article\n-- Subsection (1)\n-- Subsection Content: No objection to an indictment shall be taken by way of demurrer, but if an indictment does not state in substance an indictable offence or states an offence not triable by the court, the accused person may move the court to quash it or in arrest of judgment. (Amended 50 of 1911 s. 4 )\n-- Subsection (2)\n-- Subsection Content: If such motion is made before the accused person pleads, the court shall either quash the indictment or amend it. (Amended 50 of 1911 ; 1 of 1912 Schedule)\n-- Subsection (3)\n-- Subsection Content: If the defect in the indictment appears to the court during the trial, and the court does not think fit to amend the indictment, it may either quash the indictment or leave the objection to be taken in arrest of judgment. (Amended 50 of 1911 ; 1 of 1912 Schedule)\n-- Subsection (4)\n-- Subsection Content: If the indictment is quashed, the court may direct the accused person to be detained in custody until such time or for such period as the court may order or to be released on bail, and may order him to plead to another indictment when called on at the same time or during that period, as the case may be. (Amended 50 of 1911 ; 1 of 1912 Schedule; 6 of 1990 s. 4 )"
        },
        {
            "law_number": "CAP 221",
            "cap title": "Criminal Procedure Ordinance",
            "part_idx": 3,
            "part_title": "Proceedings at Trial",
            "section_idx": "63",
            "section_toc": "Section 63: Proof of previous convictions\nSection Content: In any criminal proceedings a previous conviction against any person may be proved in the manner prescribed in this section in addition to any other method of proving such conviction.\n- Article: Default Article\n-- Subsection (1)\n-- Subsection Content: In any criminal proceedings a previous conviction against any person may be proved in the manner prescribed in this section in addition to any other method of proving such conviction.\n-- Subsection (2)\n-- Subsection Leadin: There shall be produced to the court or magistrate the following—\n--- Paragraph (a)\n--- Paragraph Content: a certificate in Form 6 in Schedule 1 signed by a police officer authorized in that behalf by the Commissioner of Police certifying the particulars of any previous convictions extracted from the criminal records kept by him, and certifying that copies of the finger-prints exhibited to the certificate are copies of the finger-prints appearing from such records;\n--- Paragraph (b)\n--- Paragraph Content: a certificate in Form 7 in Schedule 1 signed by the police officer present at the taking of the finger-prints from the person before the court or magistrate in exercise of the powers conferred by section 59 of the Police Force Ordinance ( Cap. 232 ), or by order of the court or magistrate under this section, certifying that the finger-prints exhibited to the certificate are those of such person;\n--- Paragraph (c)\n--- Paragraph Content: a certificate in Form 8 in Schedule 1 signed by a police officer authorized in that behalf by the Commissioner of Police certifying that the copies of the finger-prints exhibited to Form 6 and the finger-prints exhibited to Form 7 are those of the same person. (Amended 58 of 1994 s. 4 )\n-- Subsection (3)\n-- Subsection Content: Any certificate issued under this section and purporting to be signed by a police officer shall until the contrary is proved be deemed to have been signed by such police officer and shall be evidence of the facts stated therein.\n-- Subsection (4)\n-- Subsection Content: Where no certificate in Form 7 is available the court or magistrate may order that the person before the court shall have his finger-prints taken and that such a certificate shall be prepared.\n-- Subsection (5)\n-- Subsection Content: Where it is desired to prove a conviction in any part of the Commonwealth, the court or magistrate may accept a certificate in Form 6 purporting to be signed by the person stated therein to be the person having control of the relevant criminal records, and such certificate shall be evidence of the facts stated therein. (Amended 39 of 1999 s. 3 )"
        },
        {
            "law_number": "CAP 221",
            "cap title": "Criminal Procedure Ordinance",
            "part_idx": 3,
            "part_title": "Proceedings at Trial",
            "section_idx": "67A",
            "section_toc": "Section 67A: Computation of sentences of imprisonment\nSection Content: section 3 of the Probation of Offenders Ordinance ( Cap. 298 );\n- Article: Default Article\n-- Subsection (1)\n-- Subsection Leadin: The length of any sentence of imprisonment imposed on a person by a court shall be treated as reduced by any period during which he was in custody by reason only of having been committed to custody by an order of a court made in connection with any proceedings relating to the sentence or the offence for which it was passed, or with any proceedings from which those proceedings arose, but where the person was, in respect of the offence for which the sentence of imprisonment was imposed, subject to an earlier order made under—\n--- Paragraph (a)\n--- Paragraph Content: section 3 of the Probation of Offenders Ordinance ( Cap. 298 );\n--- Paragraph (b)\n--- Paragraph Content: section 36 of the Magistrates Ordinance ( Cap. 227 ); or\n--- Paragraph (c)\n--- Paragraph Content: section 109B of this Ordinance,\n-- Subsection (1A)\n-- Subsection Leadin: The length of any sentence of imprisonment imposed on a person by a court shall also be treated as reduced by any period during which he was, immediately prior to his first appearance in court in connection with any proceeding relating to the offence for which the sentence of imprisonment was imposed, in custody—\n--- Paragraph (a)\n--- Paragraph Content: of the police, Customs and Excise Department or Independent Commission Against Corruption in connection with that offence; or\n--- Paragraph (b)\n--- Paragraph Content: under Part VII of the Immigration Ordinance ( Cap. 115 ) in connection with that offence. (Added 13 of 1995 s. 54 )\n-- Subsection (2)\n-- Subsection Content: For the purposes of this section a suspended sentence shall be treated as a sentence of imprisonment when it takes effect under section 109C and as being imposed by the order under which it takes effect.\n-- Subsection (3)\n-- Subsection Content: No period of custody, other than a period which would have been taken into account immediately before the commencement of the Criminal Procedure (Amendment) Ordinance 1983 ( 46 of 1983 ) for the purpose of reducing a term of imprisonment, shall be taken into account for the like purpose under this section unless it falls after the commencement of the Criminal Procedure (Amendment) Ordinance 1983 ( 46 of 1983 ).\n-- Subsection (3A)\n-- Subsection Content: No period of custody, other than a period which would have been taken into account immediately before the commencement of the amendment to this section effected by the Administration of Justice (Miscellaneous Provisions) Ordinance 1995 ( 13 of 1995 ) for the purpose of reducing a term of imprisonment, shall be taken into account for the like purpose under this section unless it falls after that commencement. (Added 13 of 1995 s. 54 )\n-- Subsection (4)\n-- Subsection Content: Any reference in this or any other Ordinance to the length of any sentence of imprisonment shall, unless the context otherwise requires, be construed as a reference to the sentence pronounced by the court and not the sentence as reduced by this section.\n-- Subsection (5)"
        },
        {
            "law_number": "CAP 221",
            "cap title": "Criminal Procedure Ordinance",
            "part_idx": 3,
            "part_title": "Proceedings at Trial",
            "section_idx": "73",
            "section_toc": "Section 73: Power to award compensation\nSection Content: personal injury;\n- Article: Default Article\n-- Subsection (1)\n-- Subsection Leadin: Where a person is convicted of an offence, the court may, in addition to passing such sentence as may otherwise by law be passed or making an order under section 107(1) , order the person so convicted to pay to any aggrieved person such compensation for—\n--- Paragraph (a)\n--- Paragraph Content: personal injury;\n--- Paragraph (b)\n--- Paragraph Content: loss of or damage to property; or\n--- Paragraph (c)\n--- Paragraph Content: both such injury and loss or damage,\n-- Subsection (2)\n-- Subsection Content: The amount ordered as compensation under subsection (1) shall be deemed a judgment debt due to the person entitled to receive the same from the person so convicted. (Amended 23 of 2002 s. 7 )\n-- Subsection (3)\n-- Subsection Leadin: If before an order for compensation is made, any money—\n--- Paragraph (a)\n--- Paragraph Content: was taken from the person so convicted on his apprehension, arrest, being taken into custody or his surrender to custody; or\n--- Paragraph (b)\n--- Paragraph Content: was paid into court by the person so convicted,\n-- Subsection (4)\n-- Subsection Content: Subsection (3) shall not apply to any money that is a first charge for the benefit of the Director of Legal Aid within the meaning of section 18A(1) of the Legal Aid Ordinance ( Cap. 91 ). (Added 23 of 2002 s. 7 )\n-- Subsection (5)\n-- Subsection Content: Payment of the compensation may be enforced at the instance of any person entitled thereto in the same way as a judgment debt. (Added 23 of 2002 s. 7 )"
        },
        {
            "law_number": "CAP 221",
            "cap title": "Criminal Procedure Ordinance",
            "part_idx": 3,
            "part_title": "Proceedings at Trial",
            "section_idx": "79",
            "section_toc": "Section 79: Record of proceedings and inspection thereof\nSection Content: A record (whether made by means of shorthand notes, by mechanical means or otherwise) kept in accordance with rules made under section 9 , or such other record as the trial judge may direct, shall be taken of the proceedings at the trial of any person on indictment who, if convicted, is entitled or may be authorized to appeal to the Court of Appeal.\n- Article: Default Article\n-- Subsection (1)\n-- Subsection Content: A record (whether made by means of shorthand notes, by mechanical means or otherwise) kept in accordance with rules made under section 9 , or such other record as the trial judge may direct, shall be taken of the proceedings at the trial of any person on indictment who, if convicted, is entitled or may be authorized to appeal to the Court of Appeal.\n-- Subsection (2)\n-- Subsection Leadin: A record taken under subsection (1) shall be open for inspection without fee or reward by—\n--- Paragraph (a)\n--- Paragraph Content: a judge;\n--- Paragraph (b)\n--- Paragraph Content: the Registrar;\n--- Paragraph (c)\n--- Paragraph Content: the Secretary for Justice; (Amended L.N. 362 of 1997 )\n--- Paragraph (d)\n--- Paragraph Content: a judge or deputy judge of the District Court;\n--- Paragraph (e)\n--- Paragraph Content: the registrar of the District Court;\n--- Paragraph (f)\n--- Paragraph Content: a party interested or his legal representative;\n--- Paragraph (g)\n--- Paragraph Content: any person, or his legal representative, who satisfies the Registrar that such inspection is reasonably required in connection with actual or potential civil or criminal proceedings by or against that person;\n--- Paragraph (h)\n--- Paragraph Content: any person who satisfies the Registrar that there is good and sufficient reason for that inspection.\n-- Subsection (3)\n-- Subsection Content: A decision by the Registrar to refuse permission to inspect shall be final.\n-- Subsection (4)\n-- Subsection Content: The right to inspect under subsection (2) shall include the right to a copy of the record subject, in the case of applicants under subsection (2)(g) and (h), to payment of the prescribed fee.\n-- Subsection (5)\n-- Subsection Content: Disclosure of the contents of a record under subsection (2) shall not amount to a breach of the Rehabilitation of Offenders Ordinance ( Cap. 297 ).\n-- Subsection (6)"
        },
        {
            "law_number": "CAP 221",
            "cap title": "Criminal Procedure Ordinance",
            "part_idx": 6,
            "part_title": "Appeals, Questions of Law Reserved and Referred and Review",
            "section_idx": "81",
            "section_toc": "Section 81: Power to reserve question of law for consideration of Court of Appeal\nSection Content: The judge of the court of trial may reserve for the consideration of the Court of Appeal any question of law which may arise on the trial of any indictment.\n- Article: Default Article\n-- Subsection (1)\n-- Subsection Content: The judge of the court of trial may reserve for the consideration of the Court of Appeal any question of law which may arise on the trial of any indictment.\n-- Subsection (2)\n-- Subsection Content: In exercising his power under subsection (1), the judge may act either of his own motion or on the application of the Secretary for Justice or the defence. (Amended L.N. 362 of 1997 )\n-- Subsection (3)\n-- Subsection Leadin: A judge may, if he reserves a question of law under subsection (1) and the accused person has been convicted—\n--- Paragraph (a)\n--- Paragraph Content: postpone judgment until the question has been considered and decided; and\n--- Paragraph (b)\n--- Paragraph Content: commit the person convicted to prison or admit him to bail, with or without one or more sufficient sureties, and in such sum as he may think fit, conditioned to appear at such time or times as the judge may direct and receive judgment.\n-- Subsection (4)\n-- Subsection Leadin: Upon consideration of a question reserved under subsection (1), the Court of Appeal may—\n--- Paragraph (a)\n--- Paragraph Content: affirm or quash the conviction or order a new trial; and\n--- Paragraph (b)\n--- Paragraph Content: make such other orders as may be necessary to give effect to its decision:"
        },
        {
            "law_number": "CAP 245",
            "cap title": "Public Order Ordinance",
            "part_idx": 9,
            "part_title": "General",
            "section_idx": "45",
            "section_toc": "Section 45: Use of necessary force\nSection Content: to prevent the commission or continuance of any offence under this Ordinance;"
        },
        {
            "law_number": "CAP 245",
            "cap title": "Public Order Ordinance",
            "part_idx": 9,
            "part_title": "General",
            "section_idx": "50A",
            "section_toc": "Section 50A: Obstruction\nSection Content: any member of the Chinese People’s Liberation Army; (Amended 2 of 2012 s. 3 )"
        }
    ],
    "backend_model": "/home/hansirui/.cache/huggingface/hub/models--meta-llama--Llama-3.1-70B-Instruct/snapshots/945c8663693130f8be2ee66210e062158b2a9693/"
}