{
    "question:": "What type of business structure should I choose for my startup?",
    "relevant_path": [],
    "other_relevant_path": [
        {
            "law_number": "CAP 310",
            "cap title": "Business Registration Ordinance"
        },
        {
            "law_number": "CAP 32",
            "cap title": "Companies (Winding Up and Miscellaneous Provisions) Ordinance"
        },
        {
            "law_number": "CAP 33",
            "cap title": "Co-operative Societies Ordinance"
        },
        {
            "law_number": "CAP 38",
            "cap title": "Partnership Ordinance"
        },
        {
            "law_number": "CAP 37",
            "cap title": "Limited Partnerships Ordinance"
        },
        {
            "law_number": "CAP 32",
            "cap title": "Companies (Winding Up and Miscellaneous Provisions) Ordinance",
            "part_idx": 2,
            "part_title": "Share Capital and Debentures",
            "section_idx": "42",
            "section_toc": "Section 42: Prohibition of allotment unless minimum subscription received\nSection Content: Subject to section 38A , no allotment shall be made of any share capital of a company offered to the public for subscription unless the amount stated in the prospectus as the minimum amount which, in the opinion of the directors must be raised by the issue of share capital in order to provide for the matters specified in paragraph 7 in Part I of the Third Schedule has been subscribed, and the sum payable on application for the amount so stated has been paid to and received by the company. For the purposes of this subsection, a sum shall be deemed to have been paid to and received by the company if a cheque for that sum has been received in good faith by the company and the directors of the company have no reason for suspecting that the cheque will not be paid. (Amended 78 of 1972 s. 11 ; 86 of 1992 s. 8 )\n- Article: Default Article\n-- Subsection (1)\n-- Subsection Content: Subject to section 38A , no allotment shall be made of any share capital of a company offered to the public for subscription unless the amount stated in the prospectus as the minimum amount which, in the opinion of the directors must be raised by the issue of share capital in order to provide for the matters specified in paragraph 7 in Part I of the Third Schedule has been subscribed, and the sum payable on application for the amount so stated has been paid to and received by the company. For the purposes of this subsection, a sum shall be deemed to have been paid to and received by the company if a cheque for that sum has been received in good faith by the company and the directors of the company have no reason for suspecting that the cheque will not be paid. (Amended 78 of 1972 s. 11 ; 86 of 1992 s. 8 )\n-- Subsection (2)\n-- Subsection Content: The amount so stated in the prospectus shall be reckoned exclusively of any amount payable otherwise than in cash and is in this Ordinance referred to as the minimum subscription.\n-- Subsection (3)\n-- Subsection Content: The amount payable on application on each share shall not be less than 5 per cent of the issue price of the share. (Amended 28 of 2012 ss. 912 & 920)\n-- Subsection (4)\n-- Subsection Leadin: Subject to section 38A , if the conditions aforesaid have not been complied with on the expiration of 30 days after the first issue of the prospectus, all money received from applicants for shares shall be forthwith repaid to them without interest, and, if any such money is not so repaid within 38 days after the issue of the prospectus, the directors of the company shall be jointly and severally liable to repay that money with interest at the rate of 8 per cent per annum from the expiration of the 38th day: (Amended 86 of 1992 s. 8 )\n-- Subsection Content: Subject to section 38A , if the conditions aforesaid have not been complied with on the expiration of 30 days after the first issue of the prospectus, all money received from applicants for shares shall be forthwith repaid to them without interest, and, if any such money is not so repaid within 38 days after the issue of the prospectus, the directors of the company shall be jointly and severally liable to repay that money with interest at the rate of 8 per cent per annum from the expiration of the 38th day: (Amended 86 of 1992 s. 8 )\nProvided that a director shall not be liable if he proves that the default in the repayment of the money was not due to any misconduct or negligence on his part. (Replaced 78 of 1972 s. 11 )\n-- Subsection (5)\n-- Subsection Content: Any condition requiring or binding any applicant for shares to waive compliance with any requirement of this section shall be void.\n-- Subsection (6)\n-- Subsection Content: This section, except subsection (3), shall not apply to any allotment of shares subsequent to the first allotment of shares offered to the public for subscription."
        },
        {
            "law_number": "CAP 32",
            "cap title": "Companies (Winding Up and Miscellaneous Provisions) Ordinance",
            "part_idx": 5,
            "part_title": "(Repealed)",
            "section_idx": "154",
            "section_toc": "Section 154: "
        },
        {
            "law_number": "CAP 32",
            "cap title": "Companies (Winding Up and Miscellaneous Provisions) Ordinance",
            "part_idx": 5,
            "part_title": "(Repealed)",
            "section_idx": "157",
            "section_toc": "Section 157: "
        },
        {
            "law_number": "CAP 32",
            "cap title": "Companies (Winding Up and Miscellaneous Provisions) Ordinance",
            "part_idx": 9,
            "part_title": "Winding Up",
            "section_idx": "169",
            "section_toc": "Section 169: Modes of winding up\nSection Content: by the court; or\n- Article: Default Article\n-- Subsection (1)\n-- Subsection Leadin: The winding up of a company may be either—\n--- Paragraph (a)\n--- Paragraph Content: by the court; or\n--- Paragraph (b)\n--- Paragraph Content: voluntary. (Amended 6 of 1984 s. 126 )\n-- Subsection (2)\n-- Subsection Content: The provisions of this Ordinance with respect to winding up apply, unless the contrary appears, to the winding up of a company in any of those modes."
        },
        {
            "law_number": "CAP 32",
            "cap title": "Companies (Winding Up and Miscellaneous Provisions) Ordinance",
            "part_idx": 9,
            "part_title": "Winding Up",
            "section_idx": "228",
            "section_toc": "Section 228: Circumstances in which company may be wound up voluntarily\nSection Content: when the period, if any, fixed for the duration of the company by the articles expires, or the event, if any, occurs on the occurrence of which the articles provide that the company is to be dissolved, and the company in general meeting has passed a resolution requiring the company to be wound up voluntarily; (Replaced 6 of 1984 s. 160 . Amended 28 of 2012 ss. 912 & 920)\n- Article: Default Article\n-- Subsection (1)\n-- Subsection Leadin: A company may be wound up voluntarily—\n--- Paragraph (a)\n--- Paragraph Content: when the period, if any, fixed for the duration of the company by the articles expires, or the event, if any, occurs on the occurrence of which the articles provide that the company is to be dissolved, and the company in general meeting has passed a resolution requiring the company to be wound up voluntarily; (Replaced 6 of 1984 s. 160 . Amended 28 of 2012 ss. 912 & 920)\n--- Paragraph (b)\n--- Paragraph Content: if the company resolves by special resolution that the company be wound up voluntarily;\n--- Paragraph (c)\n--- Paragraph (d)\n--- Paragraph Content: if the directors of the company or, in the case of a company having more than 2 directors, the majority of the directors, deliver to the Registrar a winding-up statement under section 228A . (Added 75 of 1993 s. 13 . Amended 28 of 2003 s. 82 )\n-- Subsection (2)"
        },
        {
            "law_number": "CAP 32",
            "cap title": "Companies (Winding Up and Miscellaneous Provisions) Ordinance",
            "part_idx": 9,
            "part_title": "Winding Up",
            "section_idx": "234",
            "section_toc": "Section 234: Provisions applicable to members’ winding up\nSection Content: The provisions contained in sections 235 to 239 shall apply in relation to a members’ voluntary winding up."
        },
        {
            "law_number": "CAP 32",
            "cap title": "Companies (Winding Up and Miscellaneous Provisions) Ordinance",
            "part_idx": 9,
            "part_title": "Winding Up",
            "section_idx": "260",
            "section_toc": "Section 260: "
        },
        {
            "law_number": "CAP 32",
            "cap title": "Companies (Winding Up and Miscellaneous Provisions) Ordinance",
            "part_idx": 9,
            "part_title": "Winding Up",
            "section_idx": "296A",
            "section_toc": "Section 296A: Interpretation of Division 6\nSection Content: a reference to sending a document includes supplying, delivering, forwarding or producing the document and, in the case of a notice, giving the document;\n- Article: Default Article\n-- Subsection (1)\n-- Subsection Leadin: In this Division—\n-- Subsection (2)\n-- Subsection Leadin: In this Division—\n--- Paragraph (a)\n--- Paragraph Content: a reference to sending a document includes supplying, delivering, forwarding or producing the document and, in the case of a notice, giving the document;\n--- Paragraph (b)\n--- Paragraph Content: a reference to supplying information includes sending, delivering, forwarding or producing the information; and\n--- Paragraph (c)\n--- Paragraph Leadin: a document or information is sent or supplied in hard copy form if it is sent or supplied—\n---- Subparagraph (i)\n---- Subparagraph Content: in paper form; or\n---- Subparagraph (ii)\n---- Subparagraph Content: in a similar form capable of being read."
        },
        {
            "law_number": "CAP 32",
            "cap title": "Companies (Winding Up and Miscellaneous Provisions) Ordinance",
            "part_idx": 14,
            "part_title": "Winding up of Unregistered Companies",
            "section_idx": "327",
            "section_toc": "Section 327: Winding up of unregistered companies\nSection Content: Subject to the provisions of this Part, any unregistered company may be wound up under this Ordinance, and all the provisions of this Ordinance with respect to winding up shall apply to an unregistered company, with the exceptions and additions mentioned in this section.\n- Article: Default Article\n-- Subsection (1)\n-- Subsection Content: Subject to the provisions of this Part, any unregistered company may be wound up under this Ordinance, and all the provisions of this Ordinance with respect to winding up shall apply to an unregistered company, with the exceptions and additions mentioned in this section.\n-- Subsection (2)\n-- Subsection Content: No unregistered company shall be wound up voluntarily under this Ordinance.\n-- Subsection (3)\n-- Subsection Leadin: The circumstances in which an unregistered company may be wound up are as follows—\n--- Paragraph (a)\n--- Paragraph Content: if the company is dissolved, or has ceased to carry on business, or is carrying on business only for the purpose of winding up its affairs;\n--- Paragraph (b)\n--- Paragraph Content: if the company is unable to pay its debts;\n--- Paragraph (c)\n--- Paragraph Content: if the court is of opinion that it is just and equitable that the company should be wound up.\n-- Subsection (4)\n-- Subsection Leadin: An unregistered company shall, for the purposes of this Ordinance, be deemed to be unable to pay its debts—\n--- Paragraph (a)\n--- Paragraph Leadin: if—\n---- Subparagraph (i)\n---- Subparagraph Content: by leaving the demand at the principal place of business of the company;\n---- Subparagraph (A)\n---- Subparagraph Content: by leaving the demand at the principal place of business of the company;\n---- Subparagraph (B)\n---- Subparagraph Content: by delivering the demand to any officer of the company; or\n---- Subparagraph (C)\n---- Subparagraph Content: by otherwise serving the demand in any manner that the court may approve or direct; and\n---- Subparagraph (ii)\n---- Subparagraph Content: the company has for 3 weeks after the service of the demand neglected to pay the sum, or to secure or compound for it to the reasonable satisfaction of the creditor; (Replaced 14 of 2016 s. 109 )\n--- Paragraph (b)\n--- Paragraph Content: if any action or other proceeding has been instituted against any member for any debt or demand due, or claimed to be due, from the company, or from him in his character of member, and notice in writing of the institution of the action or proceeding having been served on the company by leaving the same at its principal place of business, or by delivering it to any officer of the company, or by otherwise serving the same in such manner as the court may approve or direct, the company has not within 10 days after service of the notice paid, secured or compounded for the debt or demand, or procured the action or proceeding to be stayed, or indemnified the defendant to his reasonable satisfaction against the action or proceeding, and against all costs, damages and expenses to be incurred by him by reason of the same;\n--- Paragraph (c)\n--- Paragraph Content: if execution or other process issued on a judgment, decree or order obtained in any court in favour of a creditor against the company, or any member thereof as such, or any person authorized to be sued as nominal defendant on behalf of the company, is returned unsatisfied; or (Amended 14 of 2016 s. 109 )\n--- Paragraph (d)\n--- Paragraph Content: if it is otherwise proved to the satisfaction of the court that the company is unable to pay its debts.\n-- Subsection (5)\n-- Subsection (6)\n-- Subsection Content: The Financial Secretary may, by regulation, prescribe any amount for the purposes of subsection (5). (Added 28 of 2003 s. 103 )"
        },
        {
            "law_number": "CAP 32",
            "cap title": "Companies (Winding Up and Miscellaneous Provisions) Ordinance",
            "part_idx": 19,
            "part_title": "Prevention of Evasion of the Societies Ordinance",
            "section_idx": "360A",
            "section_toc": "Section 360A: "
        },
        {
            "law_number": "CAP 32",
            "cap title": "Companies (Winding Up and Miscellaneous Provisions) Ordinance",
            "part_idx": 19,
            "part_title": "Prevention of Evasion of the Societies Ordinance",
            "section_idx": "360K",
            "section_toc": "Section 360K: Control of Official Receiver\nSection Content: Subject to the provisions of this Part, the Official Receiver shall conform to any directions which may be given to him by the Chief Executive for the purposes of this Part. (Amended 23 of 1999 s. 3 )\n- Article: Default Article\n-- Subsection (1)\n-- Subsection Content: Subject to the provisions of this Part, the Official Receiver shall conform to any directions which may be given to him by the Chief Executive for the purposes of this Part. (Amended 23 of 1999 s. 3 )\n-- Subsection (2)\n-- Subsection Content: The Official Receiver shall with the permission of the Chief Executive be entitled to apply by originating summons to the court for directions on any matter arising out of the winding up. (Amended 23 of 1999 s. 3 )\n-- Subsection (3)\n-- Subsection Content: Any such application shall be heard and determined in such manner as the court may direct, and it shall be lawful for the court to hear such parties and persons as it may think fit.\n-- Subsection (4)\n-- Subsection Content: Without prejudice to the generality of subsection (3) the court may if it sees fit direct that the proceedings or any part thereof be heard in camera.\n-- Subsection (5)\n-- Subsection Content: If any person is aggrieved by any act or decision of the Official Receiver, that person may apply by originating summons to the court, and the court may confirm, reverse or modify the act or decision complained of, and make such order in the premises as it thinks just."
        },
        {
            "law_number": "CAP 33",
            "cap title": "Co-operative Societies Ordinance",
            "part_idx": 2,
            "part_title": "Registration",
            "section_idx": "4",
            "section_toc": "Section 4: Societies which may be registered"
        },
        {
            "law_number": "CAP 33",
            "cap title": "Co-operative Societies Ordinance",
            "part_idx": 2,
            "part_title": "Registration",
            "section_idx": "5",
            "section_toc": "Section 5: Conditions of registration\nSection Content: No society, other than a society of which a member is a registered society, shall be registered under this Ordinance, which does not consist of at least ten persons each of whom is qualified under section 21 for membership.\n- Article: Default Article\n-- Subsection (1)\n-- Subsection Content: No society, other than a society of which a member is a registered society, shall be registered under this Ordinance, which does not consist of at least ten persons each of whom is qualified under section 21 for membership.\n-- Subsection (2)\n-- Subsection Content: The word “co-operative” or “合作社” shall form part of the English name or the Chinese name respectively of every society registered under this Ordinance. (Amended 80 of 1997 s. 106 )\n-- Subsection (3)\n-- Subsection Content: The word “limited” shall be the last word in, or “有限責任” shall form part of, the English name or the Chinese name respectively of every society with limited liability registered under this Ordinance. (Replaced 21 of 1976 s. 2 . Amended 80 of 1997 s. 106 )\n-- Subsection (4)\n-- Subsection Content: When for the purposes of this section any question arises as to age, residence, or occupation of land constituting the qualification of any person, that question shall be decided by the Registrar whose decision shall be final."
        },
        {
            "law_number": "CAP 33",
            "cap title": "Co-operative Societies Ordinance",
            "part_idx": 2,
            "part_title": "Registration",
            "section_idx": "8",
            "section_toc": "Section 8: Societies to be bodies corporate\nSection Content: The registration of a society shall render it a body corporate by the name under which it is registered, with perpetual succession and with power to hold property, to enter into contracts, to institute and defend suits and other legal proceedings, and to do all things necessary for the purpose of its constitution."
        }
    ],
    "backend_model": "/home/hansirui/.cache/huggingface/hub/models--meta-llama--Llama-3.1-70B-Instruct/snapshots/945c8663693130f8be2ee66210e062158b2a9693/"
}