{
    "question:": "How can I apply for a work visa?",
    "relevant_path": [],
    "other_relevant_path": [
        {
            "law_number": "CAP 115",
            "cap title": "Immigration Ordinance"
        },
        {
            "law_number": "CAP 78",
            "cap title": "Contracts for Employment Outside Hong Kong Ordinance"
        },
        {
            "law_number": "CAP 331",
            "cap title": "Immigration Service Ordinance"
        },
        {
            "law_number": "CAP 78",
            "cap title": "Contracts for Employment Outside Hong Kong Ordinance",
            "part_idx": 1,
            "part_title": "Preliminary",
            "section_idx": "2",
            "section_toc": "Section 2: Interpretation"
        },
        {
            "law_number": "CAP 78",
            "cap title": "Contracts for Employment Outside Hong Kong Ordinance",
            "part_idx": 2,
            "part_title": "Control of Contracts for Employment Outside Hong Kong",
            "section_idx": "5",
            "section_toc": "Section 5: Contracts to be in writing and to contain certain particulars\nSection Content: Every contract to which this Ordinance applies shall be in writing, and, before the departure of the employee from Hong Kong, shall be signed by the employee and by the employer or other person acting on behalf of the employer. (Amended 48 of 1985 ss. 7 & 15)\n- Article: Default Article\n-- Subsection (1)\n-- Subsection Content: Every contract to which this Ordinance applies shall be in writing, and, before the departure of the employee from Hong Kong, shall be signed by the employee and by the employer or other person acting on behalf of the employer. (Amended 48 of 1985 ss. 7 & 15)\n-- Subsection (1A)\n-- Subsection Content: An employee who is unable to sign a contract may indicate his assent by affixing his thumb print in ink. (Replaced 33 of 1992 s. 5 )\n-- Subsection (2)\n-- Subsection Leadin: Every contract to which this Ordinance applies shall contain all such particulars as may be necessary to define the rights and obligations of the parties thereto, and shall in all cases include the following— (Amended 48 of 1985 s. 7 )\n--- Paragraph (a)\n--- Paragraph Content: the name of the employer and where applicable the name of the business or undertaking;\n--- Paragraph (b)\n--- Paragraph Content: the name of the employee and particulars of the place of engagement and the place of origin of the employee and any other particulars necessary for his identification;\n--- Paragraph (c)\n--- Paragraph Content: the name of the place at which the contract is to be performed and particulars of the nature of the employment;\n--- Paragraph (d)\n--- Paragraph Content: particulars of the rates of wages, including rates for overtime work where applicable, and the manner and periodicity of payment;\n--- Paragraph (e)\n--- Paragraph Content: particulars governing the advances of wages, if any, and the manner of repayment of any such advances;\n--- Paragraph (f)\n--- Paragraph Content: except in the case of a contract for employment in domestic service, particulars of the days and hours during which the employee may be called on to work and of his entitlement in respect of rest days, paid holidays and annual leave, the terms of which shall not be less favourable than those laid down in the Employment Ordinance ( Cap. 57 );\n--- Paragraph (g)\n--- Paragraph Content: particulars of the duration of the contract, the grounds of, provision for, and manner of, terminating the contract, provisions for varying the contract and provisions for re-engagement of the employee, including that the employer shall give the employee a minimum of 1 month’s notice or wages in lieu of notice to terminate the contract otherwise than by a summary dismissal;\n--- Paragraph (h)\n--- Paragraph Content: a stipulation that the contract shall not be transferred from the employer to any other employer except with the consent of the employee freely given and not obtained by or as a result of any threat, intimidation, bribery, deceit, undue influence, misrepresentation or mistake, and except with the endorsement of the transfer upon the contract by an officer or official of the place in which the contract is performed for the time being responsible for matters pertaining to employment; (Amended 56 of 2000 s. 3 )\n--- Paragraph (i)\n--- Paragraph Content: particulars of the measures to be taken to provide for the welfare of the employee and any dependants who may accompany him under the terms of the contract, including particulars as to medical treatment, compensation in the event of the death of or injury to, or incapacity due to occupational disease of, the employee arising out of and in the course of the employment, and the provision of food and quarters;\n--- Paragraph (ia)\n--- Paragraph Content: in addition to the particulars required under paragraph (i), the contract shall provide that where the employee suffers personal injury by accident or occupational disease arising out of or in the course of employment, the employer shall defray the expenses necessarily incurred by the employee on account of medical treatment, including maintenance in hospital, during the employee’s incapacity, pay or arrange with the appropriate authority for payment of compensation in accordance with the law of the place of employment or, if no law on compensation exists, the employer shall pay compensation not less favourable than that laid down in the Employees’ Compensation Ordinance ( Cap. 282 ) and be responsible for all expenses incurred whenever the employee is required to undergo a medical assessment for the purpose of employees’ compensation and that where the employee is ill or suffers from an accident not attributable to his employment, the employer shall provide free medical attention and maintenance in hospital to the employee while he is incapacitated. In the event of illness or incapacity not attributable to the employee’s employment, the employer shall pay the employee, as a minimum, full wages for the first month of incapacity and half wages for at least 3 months thereafter; (Added 33 of 1992 s. 5 . Amended 56 of 2000 s. 3 )\n--- Paragraph (j)\n--- Paragraph Content: particulars relating to the passage of the employee and his dependants to and from the place at which the contract is to be performed and an undertaking that the passage of the employee and his dependants to the place at which the contract is to be performed and all necessary documents, including travel and employment permits, for the employee and his dependants shall be provided by or on behalf of the employer free of charge to the employee and his dependants;\n--- Paragraph (k)\n--- Paragraph Content: an undertaking that, upon the termination of contract, the employee, if he so requests the employer within 3 months after such termination, shall be repatriated at the employer’s expense (which shall include travelling and subsistence expenses during the journey and subsistence expenses during the period, if any, between the date of such termination and the date of repatriation other than a period during which repatriation has been delayed by the employee’s own choice or for reasons of force majeure) to his place of engagement or, at the employee’s request, to his place of origin if such place is nearer to the place at which the contract was performed, together with his dependants (if any) who were brought to the place at which the contract was performed by or on behalf of the employer; (Amended 48 of 1985 s. 7 )\n--- Paragraph (l)\n--- Paragraph Content: an undertaking that in the event of the death of the employee his dependants (if any) who were brought to the place at which the contract was being performed by or on behalf of the employer shall, if they so request within 3 months after the death of the employee, be repatriated at the employer’s expense (which shall include travelling and subsistence expenses referred to in paragraph (k)) to the employee’s place of engagement or, at their request, to the employee’s place of origin if such place is nearer to the place at which the contract was being performed;\n--- Paragraph (m)\n--- Paragraph Content: a stipulation that the employer shall provide free of charge facilities for the employee to make remittances to his family or dependants in Hong Kong; (Amended 48 of 1985 s. 15 )\n--- Paragraph (n)\n--- Paragraph Leadin: an undertaking that, on the expiry of the contract, the employee will not be required to begin the employment stipulated in any re-engagement contract if—\n---- Subparagraph (i)\n---- Subparagraph Content: on the expiry of the contract, he has been separated from all his dependants for more than 18 months; or\n---- Subparagraph (ii)\n---- Subparagraph Content: the period served under such contract together with the duration stipulated in the re-engagement contract will involve the separation of the employee from all his dependants for more than 18 months,\n--- Paragraph (o)\n--- Paragraph Content: any other special conditions of the contract."
        },
        {
            "law_number": "CAP 78",
            "cap title": "Contracts for Employment Outside Hong Kong Ordinance",
            "part_idx": 2,
            "part_title": "Control of Contracts for Employment Outside Hong Kong",
            "section_idx": "10",
            "section_toc": "Section 10: Medical examination prior to attestation\nSection Content: Every employee who enters into a contract to which this Ordinance applies shall, at the expense of the employer or other person acting on the employer’s behalf, be medically examined prior to the attestation of the contract as to his fitness to perform the work contemplated by the contract."
        },
        {
            "law_number": "CAP 78",
            "cap title": "Contracts for Employment Outside Hong Kong Ordinance",
            "part_idx": 2,
            "part_title": "Control of Contracts for Employment Outside Hong Kong",
            "section_idx": "11",
            "section_toc": "Section 11: Attestation of contracts\nSection Content: the employee has freely consented to the contract and that the consent has not been obtained by or as a result of any threat, intimidation, bribery, deceit, undue influence, misrepresentation or mistake;\n- Article: Default Article\n-- Subsection (1)\n-- Subsection Leadin: Before attesting any contract pursuant to section 6 , the Commissioner shall satisfy himself that—\n--- Paragraph (a)\n--- Paragraph Content: the employee has freely consented to the contract and that the consent has not been obtained by or as a result of any threat, intimidation, bribery, deceit, undue influence, misrepresentation or mistake;\n--- Paragraph (b)\n--- Paragraph Content: the employee has fully understood the terms of the contract;\n--- Paragraph (c)\n--- Paragraph Content: the contract is in accordance with the requirements of this Ordinance;\n--- Paragraph (d)\n--- Paragraph Content: in relation to the employee, there has been no contravention of any of the provisions of section 51 of the Employment Ordinance ( Cap. 57 ); (Amended 38 of 1968 s. 37 )\n--- Paragraph (e)\n--- Paragraph Content: the provisions relating to medical examination set out in section 10 have been complied with and the employee is in a fit condition to perform the contract;\n--- Paragraph (f)\n--- Paragraph Content: any bond or guarantee required to be furnished has been furnished in accordance with section 8 ; and (Amended 21 of 2024 s. 5 )\n--- Paragraph (g)\n--- Paragraph Content: the employee has declared himself not bound by a previous engagement. (Amended 21 of 2024 s. 5 )\n--- Paragraph (h)\n-- Subsection (2)\n-- Subsection Leadin: The Commissioner may refuse to attest any such contract—\n--- Paragraph (a)\n--- Paragraph Content: if he is not satisfied in regard to any of the matters specified in subsection (1); or\n--- Paragraph (b)\n--- Paragraph Content: if he is satisfied that the terms thereof are unfair to the employee or do not adequately protect the employee’s interest,\n-- Subsection (3)\n-- Subsection Leadin: Where the Commissioner attests any such contract, he shall attest not less than 2 copies in addition to the original and shall—\n--- Paragraph (a)\n--- Paragraph Content: deliver one copy to the employee; and\n--- Paragraph (b)\n--- Paragraph Content: retain one copy in safe custody for a period of not less than 6 years."
        },
        {
            "law_number": "CAP 78",
            "cap title": "Contracts for Employment Outside Hong Kong Ordinance",
            "part_idx": 2,
            "part_title": "Control of Contracts for Employment Outside Hong Kong",
            "section_idx": "14",
            "section_toc": "Section 14: Offence where contract not attested etc. before departure of employee\nSection Content: is not in writing; or"
        }
    ],
    "backend_model": "/home/hansirui/.cache/huggingface/hub/models--meta-llama--Llama-3.1-70B-Instruct/snapshots/945c8663693130f8be2ee66210e062158b2a9693/"
}